### Basic Merge Using a Dataframe Column

In [2]:
import pandas as pd
df1=pd.DataFrame({"City":["Chicago","New-york","Baltimore","San diego"],"Temperature":[21,14,35,24]})
df1

        City  Temperature
0    Chicago           21
1   New-york           14
2  Baltimore           35
3  San diego           24

In [3]:
import pandas as pd
df2=pd.DataFrame({"City":["Chicago","New-york","Baltimore","Texas"],"Humidity":[65,68,75,46]})
df2

        City  Humidity
0    Chicago        65
1   New-york        68
2  Baltimore        75
3      Texas        46

In [5]:
df3=pd.merge(df1,df2,on="City")
df3

        City  Temperature  Humidity
0    Chicago           21        65
1   New-york           14        68
2  Baltimore           35        75

### Inner join

In [ ]:
#Inner Join take common element in both DataFrame

In [6]:
df4=pd.merge(df1,df2,on="City",how="inner")
df4

        City  Temperature  Humidity
0    Chicago           21        65
1   New-york           14        68
2  Baltimore           35        75

### Outer Join

In [ ]:
#outer join take all element in both DataFrame

In [7]:
df4=pd.merge(df1,df2,on="City",how="outer")
df4

        City  Temperature  Humidity
0    Chicago         21.0      65.0
1   New-york         14.0      68.0
2  Baltimore         35.0      75.0
3  San diego         24.0       NaN
4      Texas          NaN      46.0

### Left join

In [9]:
df4=pd.merge(df1,df2,on="City",how="left")
df4

        City  Temperature  Humidity
0    Chicago           21      65.0
1   New-york           14      68.0
2  Baltimore           35      75.0
3  San diego           24       NaN

### Right Join

In [10]:
df4=pd.merge(df1,df2,on="City",how="right")
df4

        City  Temperature  Humidity
0    Chicago         21.0        65
1   New-york         14.0        68
2  Baltimore         35.0        75
3      Texas          NaN        46

### Indictor Flag

In [13]:
df3=pd.merge(df1,df2,on="City",how="outer", indicator="True") 
df3

        City  Temperature  Humidity        True
0    Chicago         21.0      65.0        both
1   New-york         14.0      68.0        both
2  Baltimore         35.0      75.0        both
3  San diego         24.0       NaN   left_only
4      Texas          NaN      46.0  right_only

### If we have two same data frame,Then it will automatically show x,y dataframe.

In [14]:
import pandas as pd
df1=pd.DataFrame({"City":["Chicago","New-york","Baltimore","San diego"],"Temperature":[21,14,35,24],"Humidity":[65,68,75,68]})
df1

        City  Temperature  Humidity
0    Chicago           21        65
1   New-york           14        68
2  Baltimore           35        75
3  San diego           24        68

In [16]:
import pandas as pd
df2=pd.DataFrame({"City":["Chicago","New-york","texas","Los-angeles"],"Temperature":[23,16,38,26],"Humidity":[67,70,78,70]})
df2

          City  Temperature  Humidity
0      Chicago           23        67
1     New-york           16        70
2        texas           38        78
3  Los-angeles           26        70

In [17]:
df3=pd.merge(df1,df2,on="City",how="inner")  
df3

       City  Temperature_x  Humidity_x  Temperature_y  Humidity_y
0   Chicago             21          65             23          67
1  New-york             14          68             16          70

In [18]:
df4=pd.merge(df1,df2,on="City",how="inner", suffixes=("_first","_second")) 
df4

,City,Temperature_first,Humidity_first,Temperature_second,Humidity_second
0,Chicago,21,65,23,67
1,New-york,14,68,16,70